Autodesk.Revit.UI.UIDocument.ShowElementsWithOutline(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.Outline)
Shows the given outline of the elements by zoom to fit.
elementIds: The set of element ids which will be shown.
outline: Outline of the elements that will be zoomed in.
Remarks:
Places the given outline in the center of screen by moving the view.
If elementIds is null or empty, the outline will be zoomed in the active view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: outline is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: outline is empty.
Throws Autodesk.Revit.Exceptions.ArgumentException: Member of elementIds is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Member of elementIds is not valid.